SunCity/src/InformationRegisters/УдалитьРаспределениеПродажУслугПоОрганизациям/УдалитьРаспределениеПродажУслугПоОрганизациям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УдалитьРаспределениеПродажУслугПоОрганизациям</name>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ВидНалога</name>
    <type>
      <types>EnumRef.УдалитьВидыНалогов</types>
    </type>
  </resources>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ТоварныеГруппы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SunCity/src/InformationRegisters/УдалитьРаспределениеПродажУслугПоОрганизациям/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Процедура записывает данные в регистр.
//
// Параметры:
//	ТаблицаРегистра	- Таблица значений, структура = структура регистра.
//
// Возвращаемое значение
//	Нет
//
Процедура ЗаписатьДанныеВРегистр(ТаблицаРегистра) Экспорт
	
	Если ТаблицаРегистра.Количество() > 0 Тогда
		
		Для Каждого СтрокаТаблицыРегистра Из ТаблицаРегистра Цикл
			
				НаборЗаписей = РегистрыСведений.УдалитьРаспределениеПродажУслугПоОрганизациям.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Магазин.Установить(СтрокаТаблицыРегистра.Магазин);
				НаборЗаписей.Отбор.ТоварнаяГруппа.Установить(СтрокаТаблицыРегистра.ТоварнаяГруппа);
				НаборЗаписей.Прочитать();
				НаборЗаписей.Очистить();
				
				Если НЕ СтрокаТаблицыРегистра.Очистить Тогда
					
					ЗаписьРегистра = НаборЗаписей.Добавить();
					ЗаполнитьЗначенияСвойств(ЗаписьРегистра, СтрокаТаблицыРегистра);
					
				КонецЕсли;
				
				НаборЗаписей.Записать(Истина);
				
		КонецЦикла;
		
	Иначе
		
		НаборЗаписей = РегистрыСведений.УдалитьРаспределениеПродажУслугПоОрганизациям.СоздатьНаборЗаписей();
		НаборЗаписей.Прочитать();
		НаборЗаписей.Записать();
		
	КонецЕсли;

КонецПроцедуры

			
// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Магазин)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти
